roma-cezar/NRF5x_SDK12_GIT/blinky_esp8266/main.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

/** @file
 *
 * @defgroup blinky_example_main main.c
 * @{
 * @ingroup blinky_example
 * @brief Blinky Example Application main file.
 *
 * This file contains the source code for a sample application to blink LEDs.
 *
 */

#include <stdbool.h>
#include <stdint.h>
#include "nrf_delay.h"
#include "boards.h"
#include "ESP8266.h"



uint8_t answer[UART_BUFF_SIZE];
/**
 * @brief Function for application main entry.
 */
int main(void)
{
    /* Configure board. */
    bsp_board_leds_init();
		Serial_Config(115200UL);
		SEGGER_RTT_WriteString(0, (const char*)"LOG: System started!\r\n");
		nrf_delay_ms(1000);

		if(ESP8266_AtSend(answer, "AT+RST", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}
		nrf_delay_ms(1000);
		
		if(ESP8266_AtSend(answer, "AT", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}
		
		if(ESP8266_AtSend(answer, "AT+GMR", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}	

		if(ESP8266_AtSend(answer, "AT+CWLAP", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}	

		if(ESP8266_AtSend(answer, "AT+CWJAP=\"dd-wrt\",\"bora-bora04\"", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}	
		
		if(ESP8266_AtSend(answer, "AT+CIFSR", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}	
		
		if(ESP8266_AtSend(answer, "AT+PING=\"192.168.1.1\"", "OK")){
			SEGGER_RTT_WriteString(0, (const char*)answer);
			SEGGER_RTT_WriteString(0, (const char*)"\r\n");
		}	
    /* Toggle LEDs. */
    while (true)
    {
        for (int i = 0; i < LEDS_NUMBER; i++)
        {
            bsp_board_led_invert(i);
            nrf_delay_ms(250);
        }
    }
}

/**
 *@}
 **/
